app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["username", "Yash Patel"], ["updated_at", "2021-07-28 06:51:27.603516"], ["password_digest", "$2a$12$BlRae19pZkDeo/utvNkypuO0AUxJ5CxjhtVG/X.Qvnd4hHemhiljK"], ["id", 3]]
---
  def update
    if @user.update(user_params)